Repository: kolaente/nfc-adventures
Catalog: lib/l10n/app_*.arb
Languages: de

# bottomNavScan
source: Scan
de: Scannen

# bottomNavCollection
source: Collection
de: Sammlung

# adventureSelectionTitle
source: Select Adventure
de: Abenteuer auswählen

# scanInstructions
source: Hold your tag near the reader...
de: Halte deinen Tag an den Reader...

# qrScanInstructions
source: Point camera at QR code to scan adventure
de: Richte die Kamera auf den QR-Code, um das Abenteuer zu scannen

# tagScannedSuccess
source: Tag scanned: {tagName}
de: Tag gescannt: {tagName}

# nfcPrompt
source: Hold your device near the NFC tag
de: Halte dein Gerät an den NFC-Tag

# errorGeneric
source: Error: {error}
de: Fehler: {error}

# errorInvalidQrCode
source: Invalid QR code
de: Ungültiger QR-Code

source: Error loading tags
de: Fehler beim Laden der Tags

# errorLoadingAdventures
source: Failed to load adventures
de: Abenteuer konnten nicht geladen werden

# errorDownloadingAdventure
source: Failed to download adventure
de: Abenteuer konnte nicht heruntergeladen werden

# errorLoadingAdventureTitle
source: Error loading adventure title: {error}
de: Fehler beim Laden des Abenteuer-Titels: {error}

# retryButton
source: Retry
de: Nochmal versuchen

source: Unknown Adventure
de: Unbekanntes Abenteuer

source: Unknown Tag
de: Unbekannter Tag

# tagCollectionCounter
source: {collected} of {total} tags found
de: {collected} von {total} Tags gefunden

source: All tags found!
de: Alle Tags gefunden!
